<a href="https://colab.research.google.com/github/usm-cos422-522/courseMaterials/blob/main/Lectures/Babynames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pp
%matplotlib inline

In [ ]:
import urllib.request
import os.path
import zipfile

data_url = "https://www.ssa.gov/oact/babynames/state/namesbystate.zip"
local_filename = "babynamesbystate.zip"
if not os.path.exists(local_filename): # if the data exists don't download again
    with urllib.request.urlopen(data_url) as resp, open(local_filename, 'wb') as f:
        f.write(resp.read())

zf = zipfile.ZipFile(local_filename, 'r')

st_name = ['NH.TXT', 'MA.TXT',  'ME.TXT', 'VT.TXT']
field_names = ['State', 'Gender', 'Year', 'Name', 'Count']
babynames = pd.DataFrame()

for st in st_name:
    with zf.open(st) as fh:
        st_babynames = pd.read_csv(fh, header=None, names=field_names)
        babynames = pd.concat([babynames, st_babynames])

babynames.sample(10)

       State Gender  Year     Name  Count
17585     ME      F  1981    Susan     18
12927     MA      F  1943     Jean    437
12099     VT      F  1995    Megan     32
16696     NH      F  2000  Rebecca     48
74990     MA      M  1922   Calvin     16
34287     NH      M  1995     Alex     29
114576    MA      M  2011   Austin    120
7379      NH      F  1958    Sandy      6
94285     MA      M  1976     Jeff     12
38901     ME      M  1963    James    379

In [ ]:
babynames.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            29473, 29474, 29475, 29476, 29477, 29478, 29479, 29480, 29481,
            29482],
           dtype='int64', length=245450)

In [65]:
# How many years did the name appear in a state ?
babynames['Name'].value_counts()

John       518
Robert     510
William    500
James      498
Joseph     483
          ...
Coen         1
Shannah      1
Jerrod       1
Ileana       1
Heide        1
Name: Name, Length: 5705, dtype: int64

In [ ]:
babynames.iloc[1:5]     # or babynames[1:5]

  State Gender  Year     Name  Count
1    NH      F  1910  Dorothy     39
2    NH      F  1910    Alice     35
3    NH      F  1910    Helen     30
4    NH      F  1910  Lillian     29

In [ ]:
babynames_index = babynames.set_index(['Name','State','Year']).sort_index()
babynames_index

                  Gender  Count
Name   State Year
Aaden  MA    2008      M     10
             2009      M     25
             2012      M      5
       ME    2009      M      5
Aadhya MA    2013      F      8
...                  ...    ...
Zyaire MA    2021      M     13
Zyla   MA    2021      F      5
Zylah  MA    2020      F      5
Zyon   MA    2013      M      6
             2021      M      8

[245450 rows x 2 columns]

In [ ]:
babynames_index.index

MultiIndex([( 'Aaden', 'MA', 2008),
            ( 'Aaden', 'MA', 2009),
            ( 'Aaden', 'MA', 2012),
            ( 'Aaden', 'ME', 2009),
            ('Aadhya', 'MA', 2013),
            ('Aadhya', 'MA', 2014),
            ('Aadhya', 'MA', 2015),
            ('Aadhya', 'MA', 2016),
            ('Aadhya', 'MA', 2018),
            ('Aadhya', 'MA', 2019),
            ...
            ( 'Zyair', 'MA', 2021),
            ('Zyaire', 'MA', 2016),
            ('Zyaire', 'MA', 2018),
            ('Zyaire', 'MA', 2019),
            ('Zyaire', 'MA', 2020),
            ('Zyaire', 'MA', 2021),
            (  'Zyla', 'MA', 2021),
            ( 'Zylah', 'MA', 2020),
            (  'Zyon', 'MA', 2013),
            (  'Zyon', 'MA', 2021)],
           names=['Name', 'State', 'Year'], length=245450)

In [ ]:
babynames_index.columns

Index(['Gender', 'Count'], dtype='object')

In [ ]:
#Hierarchical index makes it easier to locate subsets of records. What are all the years that the name
# Bruce was given as a name in the state or Maine ?
babynames_index.loc[('Bruce','ME'),['Count']]      # babynames_index.loc[('Bruce', 'ME')].index will gives years

      Count
Year
1917      5
1918      6
1923      5
1924     12
1925      8
...     ...
1991     12
1992      8
1994      5
1995      5
1998      5

[75 rows x 1 columns]

In [ ]:
# How many babies named Bruce in 1960 in each of the NE states
babynames_index.loc[('Bruce',slice(None),1960)]

      Gender  Count
State
MA         M    405
ME         M    127
NH         M     59
VT         M     43

In [ ]:
babynames_index.loc['Bruce',slice('MA','ME'),1960]

                 Gender  Count
Name  State Year
Bruce MA    1960      M    405
      ME    1960      M    127

In [ ]:
# How many babies named Bruce where named in the state of Maine ?
babynames_index.loc[('Bruce','ME')]['Count'].sum()

3843

In [ ]:
# Find the maximum number of Bruces in a year
babynames_index.loc[('Bruce','ME')]['Count'].max()

156

In [ ]:
# Average number of Bruce's in a year across all states
babynames_index.loc[('Bruce')]['Count'].mean()

70.30573248407643

In [ ]:
babynames_index = babynames_index.swaplevel('Name', 'State').sort_index()

In [ ]:
babynames_index.index

MultiIndex([('MA',  'Aaden', 2008),
            ('MA',  'Aaden', 2009),
            ('MA',  'Aaden', 2012),
            ('MA', 'Aadhya', 2013),
            ('MA', 'Aadhya', 2014),
            ('MA', 'Aadhya', 2015),
            ('MA', 'Aadhya', 2016),
            ('MA', 'Aadhya', 2018),
            ('MA', 'Aadhya', 2019),
            ('MA', 'Aadhya', 2020),
            ...
            ('VT',   'Zoey', 2010),
            ('VT',   'Zoey', 2011),
            ('VT',   'Zoey', 2012),
            ('VT',   'Zoey', 2013),
            ('VT',   'Zoey', 2014),
            ('VT',   'Zoey', 2015),
            ('VT',   'Zoey', 2016),
            ('VT',   'Zoey', 2017),
            ('VT',   'Zoey', 2020),
            ('VT',   'Zoey', 2021)],
           names=['State', 'Name', 'Year'], length=245450)

In [ ]:
# what name and state had the largest number of same name children ... most popular
babynames.set_index(['Count','Name']).sort_index(ascending=False)

              State Gender  Year
Count Name
3895  Robert     MA      M  1947
3828  John       MA      M  1947
3663  Robert     MA      M  1946
3608  John       MA      M  1961
3549  John       MA      M  1964
...             ...    ...   ...
5     Aaliyah    VT      F  2015
      Aadya      MA      F  2021
      Aadi       MA      M  2007
      Aaden      MA      M  2012
      Aaden      ME      M  2009

[245450 rows x 3 columns]

In [ ]:
babynames_index = babynames.set_index(['Name','State','Year','Gender']).sort_index()
babynames_index

                          Count
Name   State Year Gender
Aaden  MA    2008 M          10
             2009 M          25
             2012 M           5
       ME    2009 M           5
Aadhya MA    2013 F           8
...                         ...
Zyaire MA    2021 M          13
Zyla   MA    2021 F           5
Zylah  MA    2020 F           5
Zyon   MA    2013 M           6
             2021 M           8

[245450 rows x 1 columns]

In [ ]:
# Unstack puts the values of last index, Gender, into columns
babynames_index = babynames_index.unstack()
babynames_index

                  Count
Gender                F     M
Name   State Year
Aaden  MA    2008   NaN  10.0
             2009   NaN  25.0
             2012   NaN   5.0
       ME    2009   NaN   5.0
Aadhya MA    2013   8.0   NaN
...                 ...   ...
Zyaire MA    2021   NaN  13.0
Zyla   MA    2021   5.0   NaN
Zylah  MA    2020   5.0   NaN
Zyon   MA    2013   NaN   6.0
             2021   NaN   8.0

[240544 rows x 2 columns]

In [ ]:
# Now we have columns which are multi-index
babynames_index.columns

MultiIndex([('Count', 'F'),
            ('Count', 'M')],
           names=[None, 'Gender'])

In [ ]:
#lets access one of the two columns
babynames_index[('Count','F')]

Name    State  Year
Aaden   MA     2008    NaN
               2009    NaN
               2012    NaN
        ME     2009    NaN
Aadhya  MA     2013    8.0
                      ...
Zyaire  MA     2021    NaN
Zyla    MA     2021    5.0
Zylah   MA     2020    5.0
Zyon    MA     2013    NaN
               2021    NaN
Name: (Count, F), Length: 240544, dtype: float64

In [ ]:
# Show all the names that have both male and female babies during a given year
babynames_index[~babynames_index.isnull().any(axis=1)]

                   Count
Gender                 F      M
Name    State Year
Adam    MA    1983   8.0  673.0
              1984   7.0  635.0
Addison MA    1995   7.0    7.0
              1999   7.0    7.0
              2003  12.0    6.0
...                  ...    ...
William MA    1985   7.0  575.0
              1988   5.0  634.0
        ME    1930   5.0  186.0
Wren    MA    2021  23.0    6.0
Zion    MA    2018   9.0   36.0

[4906 rows x 2 columns]

In [ ]:
babynames_index = babynames_index.unstack()
babynames_index

             Count                                               ...       \
Gender           F                                               ...    M
Year          1910 1911 1912 1913 1914 1915 1916 1917 1918 1919  ... 2012
Name   State                                                     ...
Aaden  MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  5.0
       ME      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Aadhya MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Aadi   MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Aadya  MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
...            ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...
Zyair  MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Zyaire MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Zyla   MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Zylah  MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN
Zyon   MA      NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  ...  NaN


Gender
Year         2013 2014 2015 2016 2017 2018 2019  2020  2021
Name   State
Aaden  MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN   NaN
       ME     NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN   NaN
Aadhya MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN   NaN
Aadi   MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN   NaN
Aadya  MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN   NaN
...           ...  ...  ...  ...  ...  ...  ...   ...   ...
Zyair  MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN   6.0   5.0
Zyaire MA     NaN  NaN  NaN  7.0  NaN  5.0  6.0  10.0  13.0
Zyla   MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN   NaN
Zylah  MA     NaN  NaN  NaN  NaN  NaN  NaN  NaN   NaN   NaN
Zyon   MA     6.0  NaN  NaN  NaN  NaN  NaN  NaN   NaN   8.0

[11155 rows x 224 columns]

In [ ]:
#Get the columns
babynames_index.columns

MultiIndex([('Count', 'F', 1910),
            ('Count', 'F', 1911),
            ('Count', 'F', 1912),
            ('Count', 'F', 1913),
            ('Count', 'F', 1914),
            ('Count', 'F', 1915),
            ('Count', 'F', 1916),
            ('Count', 'F', 1917),
            ('Count', 'F', 1918),
            ('Count', 'F', 1919),
            ...
            ('Count', 'M', 2012),
            ('Count', 'M', 2013),
            ('Count', 'M', 2014),
            ('Count', 'M', 2015),
            ('Count', 'M', 2016),
            ('Count', 'M', 2017),
            ('Count', 'M', 2018),
            ('Count', 'M', 2019),
            ('Count', 'M', 2020),
            ('Count', 'M', 2021)],
           names=[None, 'Gender', 'Year'], length=224)

In [ ]:
# drop = false keeps the columns as well as having them in the index
babynames_index = babynames.set_index(['State','Name','Year', 'Gender'],drop=False).sort_index()
babynames_index

                         State Gender  Year    Name  Count
State Name   Year Gender
MA    Aaden  2008 M         MA      M  2008   Aaden     10
             2009 M         MA      M  2009   Aaden     25
             2012 M         MA      M  2012   Aaden      5
      Aadhya 2013 F         MA      F  2013  Aadhya      8
             2014 F         MA      F  2014  Aadhya      7
...                        ...    ...   ...     ...    ...
VT    Zoey   2015 F         VT      F  2015    Zoey     10
             2016 F         VT      F  2016    Zoey     12
             2017 F         VT      F  2017    Zoey      8
             2020 F         VT      F  2020    Zoey      9
             2021 F         VT      F  2021    Zoey     11

[245450 rows x 5 columns]

In [ ]:
# When we unstack gender, we have to create M/F columns for each field
babynames_index = babynames_index.unstack()
babynames_index

                  State      Gender         Year            Name        Count  \
Gender                F    M      F    M       F       M       F      M     F
State Name   Year
MA    Aaden  2008   NaN   MA    NaN    M     NaN  2008.0     NaN  Aaden   NaN
             2009   NaN   MA    NaN    M     NaN  2009.0     NaN  Aaden   NaN
             2012   NaN   MA    NaN    M     NaN  2012.0     NaN  Aaden   NaN
      Aadhya 2013    MA  NaN      F  NaN  2013.0     NaN  Aadhya    NaN   8.0
             2014    MA  NaN      F  NaN  2014.0     NaN  Aadhya    NaN   7.0
...                 ...  ...    ...  ...     ...     ...     ...    ...   ...
VT    Zoey   2015    VT  NaN      F  NaN  2015.0     NaN    Zoey    NaN  10.0
             2016    VT  NaN      F  NaN  2016.0     NaN    Zoey    NaN  12.0
             2017    VT  NaN      F  NaN  2017.0     NaN    Zoey    NaN   8.0
             2020    VT  NaN      F  NaN  2020.0     NaN    Zoey    NaN   9.0
             2021    VT  NaN      F  NaN  2021.0     NaN    Zoey    NaN  11.0


Gender                M
State Name   Year
MA    Aaden  2008  10.0
             2009  25.0
             2012   5.0
      Aadhya 2013   NaN
             2014   NaN
...                 ...
VT    Zoey   2015   NaN
             2016   NaN
             2017   NaN
             2020   NaN
             2021   NaN

[240544 rows x 10 columns]

In [ ]:
# When can drop those fields
babynames_index = babynames_index.drop(["State", "Name", "Year", "Gender"], axis=1)
babynames_index

                  Count
Gender                F     M
State Name   Year
MA    Aaden  2008   NaN  10.0
             2009   NaN  25.0
             2012   NaN   5.0
      Aadhya 2013   8.0   NaN
             2014   7.0   NaN
...                 ...   ...
VT    Zoey   2015  10.0   NaN
             2016  12.0   NaN
             2017   8.0   NaN
             2020   9.0   NaN
             2021  11.0   NaN

[240544 rows x 2 columns]

In [ ]:
babynames_index.reset_index()

       State    Name  Year Count
Gender                         F     M
0         MA   Aaden  2008   NaN  10.0
1         MA   Aaden  2009   NaN  25.0
2         MA   Aaden  2012   NaN   5.0
3         MA  Aadhya  2013   8.0   NaN
4         MA  Aadhya  2014   7.0   NaN
...      ...     ...   ...   ...   ...
240539    VT    Zoey  2015  10.0   NaN
240540    VT    Zoey  2016  12.0   NaN
240541    VT    Zoey  2017   8.0   NaN
240542    VT    Zoey  2020   9.0   NaN
240543    VT    Zoey  2021  11.0   NaN

[240544 rows x 5 columns]

## Groups
Groups are another form of hierachical ordering of data

In [72]:
# We can form groups from Index levels
babynames_index.groupby(level='Name').sum()
#babynames_index.groupby(level='State').sum()

         Count
Name
Aaden       45
Aadhya      58
Aadi         5
Aadya       34
Aaliyah   1883
...        ...
Zyair       11
Zyaire      41
Zyla         5
Zylah        5
Zyon        14

[5705 rows x 1 columns]

In [44]:
# Or we can build the group directly from the original data file
name_groups = babynames.groupby('Name')
bruce_group = name_groups.get_group('Bruce')
bruce_group

      State Gender  Year   Name  Count
23682    NH      M  1922  Bruce      7
23807    NH      M  1923  Bruce      7
23935    NH      M  1924  Bruce      7
24064    NH      M  1925  Bruce      7
24192    NH      M  1926  Bruce      5
...     ...    ...   ...    ...    ...
24309    VT      M  1984  Bruce      5
24439    VT      M  1985  Bruce      5
24569    VT      M  1986  Bruce      5
24811    VT      M  1988  Bruce      6
24940    VT      M  1989  Bruce      6

[314 rows x 5 columns]

In [50]:
bruce_group.reset_index(drop=True)

    State Gender  Year   Name  Count
0      NH      M  1922  Bruce      7
1      NH      M  1923  Bruce      7
2      NH      M  1924  Bruce      7
3      NH      M  1925  Bruce      7
4      NH      M  1926  Bruce      5
..    ...    ...   ...    ...    ...
309    VT      M  1984  Bruce      5
310    VT      M  1985  Bruce      5
311    VT      M  1986  Bruce      5
312    VT      M  1988  Bruce      6
313    VT      M  1989  Bruce      6

[314 rows x 5 columns]

In [46]:
#What state had the maximum number of Bruces
bruce_group[['State','Count']].max()

State     VT
Count    578
dtype: object

In [48]:
babynames.groupby(['Name','State']).sum()
# to get rid of sum years : babynames.groupby(['Name','State']).mean()['Count']

               Year  Count
Name   State
Aaden  MA      6029     40
       ME      2009      5
Aadhya MA     16136     58
Aadi   MA      2007      5
Aadya  MA     10085     34
...             ...    ...
Zyair  MA      4041     11
Zyaire MA     10094     41
Zyla   MA      2021      5
Zylah  MA      2020      5
Zyon   MA      4034     14

[11155 rows x 2 columns]

In [57]:
babynames.groupby(['Name','State']).get_group(('Bruce','ME'))

      State Gender  Year   Name  Count
29198    ME      M  1917  Bruce      5
29392    ME      M  1918  Bruce      6
30476    ME      M  1923  Bruce      5
30612    ME      M  1924  Bruce     12
30868    ME      M  1925  Bruce      8
...     ...    ...   ...    ...    ...
44528    ME      M  1991  Bruce     12
44764    ME      M  1992  Bruce      8
45231    ME      M  1994  Bruce      5
45431    ME      M  1995  Bruce      5
46047    ME      M  1998  Bruce      5

[75 rows x 5 columns]

In [58]:
# Finds the maximum in each numeric column
babynames.groupby(['Name','State']).get_group(('Bruce','ME')).max()

State        ME
Gender        M
Year       1998
Name      Bruce
Count       156
dtype: object